# Data science on the HMRC skilled worker data set
The below csv file has a list of companies capable of skilled worker sponsornship in the UK

In [112]:
# importing the libraries
import numpy as np
import pandas as pd

In [ ]:
skilled_worker_data = pd.read_csv('./projects/python-ml/2025-06-19-Worker.csv')
print(skilled_worker_data.count())

Organisation Name    133028
Town/City            133025
County                45163
Type & Rating        133028
Route                133028
dtype: int64

### shape of the data

In [118]:
skilled_worker_data.shape

(133028, 5)

### info

In [119]:
skilled_worker_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133028 entries, 0 to 133027
Data columns (total 5 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Organisation Name  133028 non-null  object
 1   Town/City          133025 non-null  object
 2   County             45163 non-null   object
 3   Type & Rating      133028 non-null  object
 4   Route              133028 non-null  object
dtypes: object(5)
memory usage: 5.1+ MB

### head / tail

In [137]:
skilled_worker_data.head()

,Organisation Name,Town/City,County,Type & Rating,Route
0,McMullan Shellfish,Ballymena,Co Antrim,Worker (A rating),Skilled Worker
1,(A1F1 Limited T/A ) Ultrasound Direct London,Croydon,London,Worker (A rating),Skilled Worker
2,(IECC Care) Independent Excel Care Consortium ...,Colchester,NaN,Worker (A rating),Skilled Worker
3,*ABOUTCARE HASTINGS LTD,East Sussex,NaN,Worker (A rating),Skilled Worker
4,.LITTLE NOORIYAH LTD,Smethwick,NaN,Worker (A rating),Skilled Worker

In [138]:
skilled_worker_data.tail()

,Organisation Name,Town/City,County,Type & Rating,Route
133023,ZZA CONSULTING LIMITED,LONDON,NaN,Worker (A rating),Skilled Worker
133024,ZZIY Ltd,High Wycombe,NaN,Worker (A rating),Skilled Worker
133025,ZZN STUDIO LTD,HAMPTON,NaN,Worker (A rating),Skilled Worker
133026,Zzoomm Plc,Oxford,NaN,Worker (A rating),Skilled Worker
133027,ZZZ Limited,London,NaN,Worker (A rating),Skilled Worker